In [44]:
print("hello world")

hello world

# Cleaning data, Working with missing data, Boolean Indexing.

# Cleaning Data

Wrong Data

"Wrong data" does not have to be "empty cells" or "wrong format", it can just be wrong, like if someone registered "199" instead of "1.99".

Sometimes you can spot wrong data by looking at the data set, because you have an expectation of what it should be.

If you take a look at our data set, you can see that in row 7, the duration is 450, but for all the other rows the duration is between 30 and 60.

It doesn't have to be wrong, but taking in consideration that this is the data set of someone's workout sessions, we conclude with the fact that this person did not work out in 450 minutes

# Replacing Values


One way to fix wrong values is to replace them with something else.


In our example, it is most likely a typo, and the value should be "45" instead of "450", and we could just insert "45" in row 7:


ExampleGet your own Python Server
Set "Duration" = 45 in row 7:


df.loc[7, 'Duration'] = 45

For small data sets you might be able to replace the wrong data one by one, but not for big data sets.

To replace wrong data for larger data sets you can create some rules, e.g. set some boundaries for legal values, and replace any values that are outside of the boundaries.

Example

Loop through all values in the "Duration" column.

If the value is higher than 120, set it to 120:

        for x in df.index:
        if df.loc[x, "Duration"] > 120:
            df.loc[x, "Duration"] = 120

# Removing Rows

Another way of handling wrong data is to remove the rows that contains wrong data.

This way you do not have to find out what to replace them with, and there is a good chance you do not need them to do your analyses.

Example

Delete rows where "Duration" is higher than 120:

        for x in df.index:
        if df.loc[x, "Duration"] > 120:
            df.drop(x, inplace = True)

# Working with missing data

Missing Data can occur when no information is provided for one or more items or for a whole unit. 

Missing Data is a very big problem in real life scenario.

Missing Data can also refer to as NA(Not Available) values in pandas.

import pandas as pd
import numpy as np
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
df = pd.DataFrame(dict)
 df.isnull()

In [45]:
import pandas as pd
import numpy as np
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
df = pd.DataFrame(dict)
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [46]:
#Example:
import pandas as pd
import numpy as np
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
df = pd.DataFrame(dict)
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

In [47]:
#Example:
import pandas as pd
import numpy as np
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, 40, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, 65]}
df = pd.DataFrame(dict)
df.dropna()

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [48]:
import pandas as pd
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
df = pd.DataFrame(dict)
for i, j in df.iterrows():
    print(i, j)
    print()

0 name      aparna
degree       MBA
score         90
Name: 0, dtype: object

1 name      pankaj
degree       BCA
score         40
Name: 1, dtype: object

2 name      sudhir
degree    M.Tech
score         80
Name: 2, dtype: object

3 name      Geeku
degree      MBA
score        98
Name: 3, dtype: object

# Boolean indexing is a type of indexing which uses actual values of the data in the DataFrame. In boolean indexing, we can filter a data in four ways – 

Accessing a DataFrame with a boolean index

Applying a boolean mask to a dataframe

Masking data based on column value

Masking data based on an index value

# Accessing a DataFrame with a boolean index : 

In order to access a dataframe with a boolean index, we have to create a dataframe in which the index of dataframe contains a boolean value that is “True” or “False”. For Example

In [49]:
# Example:
import pandas as pd
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
df = pd.DataFrame(dict, index = [True, False, True, False])
print(df)

         name  degree  score
True   aparna     MBA     90
False  pankaj     BCA     40
True   sudhir  M.Tech     80
False   Geeku     MBA     98

Now we have created a dataframe with the boolean index after that user can access a dataframe with the help of the boolean index. 

User can access a dataframe using three functions that is .loc[], .iloc[], .ix[]

# Accessing a Dataframe with a boolean index using .loc[]

In order to access a dataframe with a boolean index using .loc[], we simply pass a boolean value (True or False) in a .loc[] function. 


# Example:

                import pandas as pd
                dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
                        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
                        'score':[90, 40, 80, 98]}
                df = pd.DataFrame(dict, index = [True, False, True, False])
                print(df.loc[True])

In [50]:
import pandas as pd
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
df = pd.DataFrame(dict, index = [True, False, True, False])
print(df.loc[True])

        name  degree  score
True  aparna     MBA     90
True  sudhir  M.Tech     80

# Accessing a Dataframe with a boolean index using .iloc[]

import pandas as pd
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
df = pd.DataFrame(dict, index = [True, False, True, False])
print(df.iloc[True])

# Example:

import pandas as pd
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
df = pd.DataFrame(dict, index = [True, False, True, False])
print(df.iloc[1])

In [51]:
# import pandas as pd
# dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
#         'degree': ["MBA", "BCA", "M.Tech", "MBA"],
#         'score':[90, 40, 80, 98]}
# df = pd.DataFrame(dict, index = [True, False, True, False])
# print(df.iloc[True])

In [52]:
import pandas as pd
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
df = pd.DataFrame(dict, index = [True, False, True, False])
print(df.iloc[1])

name      pankaj
degree       BCA
score         40
Name: False, dtype: object

# Applying a boolean mask to a dataframe : 

                import pandas as pd
                dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
                        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
                        'score':[90, 40, 80, 98]}
                df = pd.DataFrame(dict, index = [0, 1, 2, 3])
                print(df[[True, False, True, False]])

In [53]:
import pandas as pd
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
df = pd.DataFrame(dict, index = [0, 1, 2, 3])
print(df[[True, False, True, False]])

     name  degree  score
0  aparna     MBA     90
2  sudhir  M.Tech     80

                import pandas as pd
                data = pd.read_excel(“Medals.xlsx”)
                df = pd.DataFrame(data, index = [0, 1, 2, 3, 4, 5, 6,
                                                7, 8, 9, 10, 11, 12])
                df[[True, False, True, False, True,
                False, True, False, True, False,
                                True, False, True]]

# Masking data based on column value : 

                import pandas as pd
                dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
                        'degree': ["BCA", "BCA", "M.Tech", "BCA"],
                        'score':[90, 40, 80, 98]}
                df = pd.DataFrame(dict)
                print(df['degree'] == 'BCA')

In [58]:
import pandas as pd
data = pd.read_excel('Medals.xlsx', sheet_name=2)
df = pd.DataFrame(data, index = [0, 1, 2, 3, 4, 5, 6,7, 8, 9, 10, 11, 12])
df[[True, False, True, False, True,
                False, True, False, True, False,
                                True, False, True]]

df

,Rank,Nation,Gold,Silver,Bronze,Total,Sorted Category,Rank.1
0,1,United States (USA),46,29,29,104,46.000001,24.000004
1,2,China (CHN),38,27,22,87,38.000002,13.000005
2,3,Great Britain (GBR)*,29,17,19,65,29.000003,11.000007
3,4,Russia (RUS),24,25,33,82,24.000004,11.000006
4,5,South Korea (KOR),13,8,7,28,13.000005,8.000009
5,6,Germany (GER),11,19,14,44,11.000006,8.000008
6,7,France (FRA),11,11,12,34,11.000007,7.000012
7,8,Italy (ITA),8,9,11,28,8.000008,7.000011
8,9,Hungary (HUN),8,4,5,17,8.000009,7.000010
9,10,Australia (AUS),7,16,12,35,7.000010,6.000014
10,11,Japan (JPN),7,14,17,38,7.000011,6.000013
11,12,Kazakhstan (KAZ),7,1,5,13,7.000012,5.000016
12,13,Netherlands (NED),6,6,8,20,6.000013,5.000015

In [59]:
import pandas as pd
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
                        'degree': ["BCA", "BCA", "M.Tech", "BCA"],
                        'score':[90, 40, 80, 98]}
df = pd.DataFrame(dict)
print(df['degree'] == 'BCA','\n\n')
print(df)

0     True
1     True
2    False
3     True
Name: degree, dtype: bool


     name  degree  score
0  aparna     BCA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     BCA     98

Example:

                import pandas as pd
                data = pd.read_excel(“Medals.xlsx", index_col =“Team\NOC")
                print(data[‘Gold'] > 25)

# Masking data based on index value : 

                import pandas as pd
                dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
                        'degree': ["BCA", "BCA", "M.Tech", "BCA"],
                        'score':[90, 40, 80, 98]}

                df = pd.DataFrame(dict, index = [0, 1, 2, 3])
                mask = df.index == 0
                print(df[mask])

In [79]:
import pandas as pd

data = pd.read_excel('Medals.xlsx', sheet_name=2)
# data = pd.read_excel('Medals.xlsx', sheet_name=2, index_col='Rank')

print(data.head(1), '\n\n')
# print(data[['Gold']>25, ['Nation']])

print(data[['Gold', 'Nation']],'\n\n')

# print(data['Gold']>25)

print(data[data['Gold']>25][['Gold', 'Nation']])

   Rank                Nation  Gold  Silver  Bronze  Total  Sorted Category  \
0     1   United States (USA)    46      29      29    104        46.000001

      Rank.1
0  24.000004


    Gold                 Nation
0     46    United States (USA)
1     38            China (CHN)
2     29   Great Britain (GBR)*
3     24           Russia (RUS)
4     13      South Korea (KOR)
..   ...                    ...
80     0        Hong Kong (HKG)
81     0     Saudi Arabia (KSA)
82     0           Kuwait (KUW)
83     0          Morocco (MAR)
84     0       Tajikistan (TJK)

[85 rows x 2 columns]


   Gold                 Nation
0    46    United States (USA)
1    38            China (CHN)
2    29   Great Britain (GBR)*

In [ ]:
# data = pd.read_excel('Medals.xlsx',sheet_name=1)
data = pd.read_excel('Medals.xlsx',sheet_name="Raw Data")

data.head(1)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,MAX,73,Unnamed: 5,Selected Min,1,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16
0,Sort,Gold,NaN,Max Min,58,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [80]:
import pandas as pd
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
                        'degree': ["BCA", "BCA", "M.Tech", "BCA"],
                        'score':[90, 40, 80, 98]}
df = pd.DataFrame(dict, index = [0, 1, 2, 3])
mask = df.index == 0
print(df[mask])

     name degree  score
0  aparna    BCA     90

        import pandas as pd
        data = pd.read_excel(“Medals.xlsx")
        df = pd.DataFrame(data, index = [0, 1, 2, 3, 4, 5, 6,
                                        7, 8, 9, 10, 11, 12])
        mask = df.index > 7
        df[mask]

In [82]:
import pandas as pd
data = pd.read_excel('Medals.xlsx', sheet_name=2)
df = pd.DataFrame(data, index = [0, 1, 2, 3, 4, 5, 6,
                                 7, 8, 9, 10, 11, 12])
mask = df.index > 7
df[mask]

,Rank,Nation,Gold,Silver,Bronze,Total,Sorted Category,Rank.1
8,9,Hungary (HUN),8,4,5,17,8.000009,7.000010
9,10,Australia (AUS),7,16,12,35,7.000010,6.000014
10,11,Japan (JPN),7,14,17,38,7.000011,6.000013
11,12,Kazakhstan (KAZ),7,1,5,13,7.000012,5.000016
12,13,Netherlands (NED),6,6,8,20,6.000013,5.000015